---
kind: event
id: E:Autodesk.Revit.UI.UIControlledApplication.FabricationPartBrowserChanged
source: html/94e52f48-80d2-979d-bd45-a97d04eaeb8f.htm
---
# Autodesk.Revit.UI.UIControlledApplication.FabricationPartBrowserChanged Event

Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.

## Syntax (C#)
```csharp
public event EventHandler<FabricationPartBrowserChangedEventArgs> FabricationPartBrowserChanged
```

## Remarks
More docs about the different conditions goes here